project/app/views/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?)  [["order_id", 2], ["order_id", 3]]
---
      <ul>
        <% order.order_items.each do |item| %>