project/app/views/admin/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?, ?)  [["order_id", 1], ["order_id", 2], ["order_id", 3]]
SELECT "orders".* FROM "orders"
---
            <tbody>
            <% order.order_items.each do |item| %>