project/app/views/types/_type.html.erb

    <b>Products of this type:</b>
    <%= (type.products.collect { |product| product.name }).join(", ") %>
---
SELECT "products".* FROM "products" WHERE "products"."type_id" = ?  [["type_id", 1]]