project/app/views/sizes/_size.html.erb

    <b>Products of this size:</b>
    <%= (size.products.collect { |product| product.name }).join(", ") %>
---
SELECT "products".* FROM "products" WHERE "products"."size_id" = ?  [["size_id", 1]]