project/app/views/colors/_color.html.erb

    <b>Products of this color:</b>
    <%= (color.products.collect { |product| product.name }).join(", ") %>
---
SELECT "products".* FROM "products" WHERE "products"."color_id" = ?  [["color_id", 1]]