project/app/views/delivery_addresses/index.html.erb

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."user_id" = ?  [["user_id", 1]]
---
<ul>
  <% current_user.delivery_addresses.each do |delivery_address| %>