project/app/controllers/cart_items_controller.rb

  def create
    @product = Product.find(params[:product_id])
    @cart_item = current_user.cart_items.find_or_initialize_by(product: @product)

    if @cart_item.new_record?
      @cart_item.quantity = 1
      @cart_item.added_at = Time.current
    else
      @cart_item.quantity += 1
    end

    respond_to do |format|
      if @cart_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["user_id", 2], ["product_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 4], ["updated_at", "2024-12-13 16:52:30.564239"], ["id", 1]]

  def destroy
    @cart_item = current_user.cart_items.find(params[:id])
    @cart_item.destroy
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def update
    @cart_item = current_user.cart_items.find(params[:id])

    respond_to do |format|
      if @cart_item.update(cart_item_params)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 3], ["updated_at", "2024-12-13 16:52:17.654831"], ["id", 1]]

  def index
    @cart_items = current_user.cart_items.includes(:product)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 2]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 1], ["id", 4]]