project/app/controllers/colors_controller.rb

  def index
    @colors = Color.all
---
SELECT "colors".* FROM "colors"

  def create
    @color = Color.new(color_params)

    respond_to do |format|
      if @color.save
---
INSERT INTO "colors" ("name", "code", "opacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "火焰红"], ["code", "#F44336"], ["opacity", 0.1], ["created_at", "2024-12-13 12:25:53.551236"], ["updated_at", "2024-12-13 12:25:53.551236"]]

    def set_color
      @color = Color.find(params[:id])
---
SELECT "colors".* FROM "colors" WHERE "colors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]