project/app/controllers/delivery_addresses_controller.rb

INSERT INTO "delivery_addresses" ("user_id", "phone", "postal_code", "address", "created_at", "updated_at", "receiver_name") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @delivery_address = current_user.delivery_addresses.build(delivery_address_params)
    respond_to do |format|
      if @delivery_address.save

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."user_id" = ? AND "delivery_addresses"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def edit
    @delivery_address = current_user.delivery_addresses.find(params[:id])

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."user_id" = ? AND "delivery_addresses"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "delivery_addresses" SET "address" = ?, "updated_at" = ? WHERE "delivery_addresses"."id" = ?  [["address", "重庆市长江的大桥"], ["updated_at", "2024-12-13 14:28:19.247516"], ["id", 2]]
---
  def update
    @delivery_address = current_user.delivery_addresses.find(params[:id])
    respond_to do |format|
      if @delivery_address.update(delivery_address_params)

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."user_id" = ? AND "delivery_addresses"."id" = ? LIMIT ?  [["user_id", 3], ["id", 5], ["LIMIT", 1]]
DELETE FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ?  [["id", 6]]
---
  def destroy
    # @delivery_address = current_user.delivery_addresses.find(params[:id])
    # @delivery_address.destroy
    #
    # respond_to do |format|
    #   format.html { redirect_to delivery_addresses_path, status: :see_other, notice: "送货地址删除成功" }
    #   format.json { head :no_content }
    # end
    @delivery_address = current_user.delivery_addresses.find(params[:id])

      respond_to do |format|
        if @delivery_address.destroy