project/app/controllers/designs_controller.rb

SELECT "designs".* FROM "designs"
---
  def index
    @designs = Design.all

INSERT INTO "designs" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "格兰芬多经典"], ["created_at", "2024-12-13 12:30:46.211238"], ["updated_at", "2024-12-13 12:30:46.211238"]]
---
  def create
    @design = Design.new(design_params)

    respond_to do |format|
      if @design.save

SELECT "designs".* FROM "designs" WHERE "designs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_design
      @design = Design.find(params[:id])