project/app/controllers/favorites_controller.rb

  def create
    @product = Product.find(params[:product_id])
    current_user.favorite_products << @product
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["product_id", 1], ["created_at", "2024-12-13 15:31:29.242008"], ["updated_at", "2024-12-13 15:31:29.242008"]]

  def destroy
    @product = Product.find(params[:product_id])
    current_user.favorite_products.delete(@product)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."product_id" = ?  [["user_id", 2], ["product_id", 1]]