project/app/controllers/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 2]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?, ?)  [["id", 1], ["id", 4], ["id", 2]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."user_id" = ? AND "delivery_addresses"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "delivery_address_id", "total_price", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["delivery_address_id", 1], ["total_price", 56.0], ["status", 0], ["created_at", "2024-12-14 08:29:30.054980"], ["updated_at", "2024-12-14 08:29:30.054980"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 3]]
SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 1], ["id", 4]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 4], ["product_id", 4], ["quantity", 2], ["price", 56.0], ["created_at", "2024-12-14 08:29:30.084114"], ["updated_at", "2024-12-14 08:29:30.084114"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 6]]
---
  def create
    cart_items = current_user.cart_items.includes(:product)
    if cart_items.empty?
      redirect_to cart_items_path, notice: '购物车为空，无法生成订单！'
      return
    end

    # 检查是否选择了有效的收货地址
    if params[:delivery_address_id].blank?
      redirect_to cart_items_path, notice: '请选择收货地址！'
      return
    end

    # 确保选择的收货地址存在且属于当前用户
    delivery_address = current_user.delivery_addresses.find_by(id: params[:delivery_address_id])
    if delivery_address.nil?
      redirect_to cart_items_path, notice: '无效的收货地址！'
      return
    end

    Order.transaction do
      @order = current_user.orders.create!(
        delivery_address_id: params[:delivery_address_id],
        total_price: cart_items.sum { |item| item.total_price },
        status: :pending
      )

      cart_items.each do |item|
        @order.order_items.create!(
          product: item.product,
          quantity: item.quantity,
          price: item.total_price
        )
      end

      cart_items.destroy_all

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?)  [["order_id", 2], ["order_id", 3]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 2]]
---
  def index
    @orders = current_user.orders.includes(:order_items)

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2024-12-14 07:45:02.110354"], ["id", 3]]
---
  def pay
    @order.update_status(:paid)

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2024-12-14 08:35:55.798770"], ["id", 4]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
UPDATE "products" SET "sales" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["sales", 1], ["updated_at", "2024-12-14 08:41:52.524692"], ["id", 4]]
---
  def confirm_receive
    @order.update_status(:delivered)

    @order.order_items.each do |order_item|
      product = order_item.product
      product.sales += order_item.quantity
      product.save!  # 保存销量更新

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 4], ["updated_at", "2024-12-14 07:44:26.785849"], ["id", 2]]
---
  def cancel
    @order.update_status(:cancelled)

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
---
  def find_order
    @order = current_user.orders.find(params[:id])