project/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "sales", "created_at", "updated_at", "color_id", "type_id", "size_id", "design_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "updated_at" = ?, "color_id" = ? WHERE "products"."id" = ?  [["updated_at", "2024-12-13 12:34:56.019049"], ["color_id", 2], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 5]]
---
  def destroy
    @product.destroy!