project/app/controllers/sizes_controller.rb

SELECT "sizes".* FROM "sizes"
---
  def index
    @sizes = Size.all

INSERT INTO "sizes" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "巨龙尺寸"], ["created_at", "2024-12-13 12:30:05.740987"], ["updated_at", "2024-12-13 12:30:05.740987"]]
---
  def create
    @size = Size.new(size_params)

    respond_to do |format|
      if @size.save

SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_size
      @size = Size.find(params[:id])