project/app/controllers/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    @types = Type.all

INSERT INTO "types" ("name", "rarity", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "飞天扫帚"], ["rarity", 2], ["created_at", "2024-12-13 12:29:06.477183"], ["updated_at", "2024-12-13 12:29:06.477183"]]
---
  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save

DELETE FROM "types" WHERE "types"."id" = ?  [["id", 4]]
---
  def destroy
    # @type.destroy!

    # respond_to do |format|
    #   format.html { redirect_to types_path, status: :see_other, notice: "Type was successfully destroyed." }
    #   format.json { head :no_content }
    # end

    respond_to do |format|
      if @type.destroy

SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_type
      @type = Type.find(params[:id])