project/app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.includes(:user, :order_items).all
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?, ?)  [["order_id", 1], ["order_id", 2], ["order_id", 3]]
SELECT "orders".* FROM "orders"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 3]]

  def ship
    order = Order.find(params[:id])
    order.update_status(:shipped)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2024-12-14 08:19:16.157902"], ["id", 3]]

  def cancel
    order = Order.find(params[:id])
    order.update_status(:cancelled)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 4], ["updated_at", "2024-12-14 08:30:43.706508"], ["id", 5]]