project/app/views/designs/_design.html.erb

    <b>Products of this design:</b>
    <%= (design.products.collect { |product| product.name }).join(", ") %>
---
SELECT "products".* FROM "products" WHERE "products"."design_id" = ?  [["design_id", 1]]