project/app/models/order.rb

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 4], ["updated_at", "2024-12-14 07:44:26.785849"], ["id", 2]]
---
  def update_status(new_status)
    self.status = new_status
    self.updated_at = Time.current