blog4/app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    @blog.user = current_user

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Ruby 环境配置"], ["content", "2153"], ["created_at", "2024-12-05 14:06:24.198464"], ["updated_at", "2024-12-05 14:06:24.198464"], ["user_id", 1]]

  def destroy
    @blog.destroy!
---
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]