blog4/app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
  def index
    @blog = Blog.find(params[:blog_id])
    @comments = Comment.all

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @blog = Blog.find(params[:blog_id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def new
    @blog = Blog.find(params[:blog_id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @blog = Blog.find(params[:blog_id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("blog_id", "contont", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["blog_id", 5], ["contont", "lalalal"], ["created_at", "2024-10-21 16:54:39.833534"], ["updated_at", "2024-10-21 16:54:39.833534"]]
---
  def create
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.new(comment_params)
    @comment.blog = @blog

    respond_to do |format|
      if @comment.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def update
    @blog = Blog.find(params[:blog_id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 980190962]]
---
  def destroy
    @blog = Blog.find(params[:blog_id])
    @comment.destroy!