blog4/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "好奇先生"], ["password", "[FILTERED]"], ["email", "[FILTERED]"], ["created_at", "2024-12-05 17:52:24.250560"], ["updated_at", "2024-12-05 17:52:24.250560"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Yixuan Kuang"], ["password", "[FILTERED]"], ["LIMIT", 1]]
---
  def do_login
    user = User.where(username: params[:username], password: params[:password]).first

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def follow
    user_to_follow = User.find(params[:id]) # 获取被关注用户

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def unfollow
    user_to_unfollow = User.find(params[:id]) # 获取取消关注的用户