project/app/views/products/_form.html.erb

SELECT "colors".* FROM "colors"
SELECT "types".* FROM "types"
SELECT "sizes".* FROM "sizes"
SELECT "designs".* FROM "designs"
---

  <div><%= form.collection_select(:color_id, Color.all, :id, :name) %></div>
  <div><%= form.collection_select(:type_id, Type.all, :id, :name) %></div>
  <div><%= form.collection_select(:size_id, Size.all, :id, :name) %></div>
  <div><%= form.collection_select(:design_id, Design.all, :id, :name) %></div>