project/app/views/products/_product.html.erb

SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <strong>大小</strong>
    <%= product.size.name %>

SELECT "products".* FROM "products"
SELECT 1 AS one FROM "products" INNER JOIN "favorites" ON "products"."id" = "favorites"."product_id" WHERE "favorites"."user_id" = ? AND "products"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  <% if current_user %>
    <% if current_user.favorite_products.include?(product) %>